[
    {
        "id": "1",
        "image": "/imgData/booki.png",
        "title": "Booki",
        "description": "Entreprise souhaitant développer un site internet permettant aux utilisateurs des hébergements ainsi que des activités dans la ville de leur choix. J'ai donc intégré l'interface du site depuis une maquette figma. Le site est commandé en desktop first, et la partie responsive a été travaillée dans un second temps.",
        "filtre": ["Tous", "Html/Css"],
        "tag": ["Html", "Css", "Responsive design"],
        "urlCode": "https://github.com/OCAntoni/Projet-3",
        "urlWebsite": "https://ocantoni.github.io/Projet-3/"
    },
    {
        "id": "2",
        "image": "/imgData/ohmyfood.png",
        "title": "Ohmyfood",
        "description": "Jeune startup dans le domaine de la restauration, ohmyfood était dans le besoin d'un site internet qui répertorie des restaurants gastronomiques. J'ai été en charge du développement de celui ci en mobile first, mais aussi de l'intégration des animations en SCSS.",
        "filtre": ["Tous", "Html/Css"],
        "tag": ["Html", "Scss", "Responsive design"],
        "urlCode": "https://github.com/OCAntoni/Projet-4",
        "urlWebsite": "https://ocantoni.github.io/Projet-4/"
    },
    {
        "id": "3",
        "image": "/imgData/print-it.png",
        "title": "Print it!",
        "description": "Print it est une entreprise d'imprimerie qui disposait déjà d'un site internet en single page, et qui souhaitait dynamiser ce dernier. J'ai donc travaillé sur l'ajout d'un diaporama d'images en utilisant principalement javascript.",
        "filtre": ["Tous", "Javascript"],
        "tag": ["Html", "Css", "Javascript"],
        "urlCode": "https://github.com/OCAntoni/Projet-5",
        "urlWebsite": "https://ocantoni.github.io/Projet-5/"
    },
    {
        "id": "4",
        "image": "/imgData/sophie_bluel.png",
        "title": "Sophie Bluel, portfolio",
        "description": "Sophie Bluel est une architecte d'intérieur souhaitant un site portfolio. Sur ce projet entre autre, il y a eu le développement front end, la gestion de connexion administrateur, le filtre et le tri de données, ainsi que la communication avec une API pour supprimer ou ajouter des projets de travail.",
        "filtre": ["Tous", "Javascript"],
        "tag": ["Html", "Css", "Javascript", "Login"],
        "urlCode": "https://github.com/OCAntoni/Projet-6",
        "urlWebsite": ""
    },
    {
        "id": "5",
        "image": "/imgData/kasa.webp",
        "title": "Kasa",
        "description": "Kasa est une entreprise leader dans le domaine de la location entre particuliers en France. J'ai donc construit un site internet en utilsant la techno. React. Egalement, grâce à React Router, j'ai pu passer des paramètres d'URL dynamiques à mes composants. Cela m'a permis d'implémenter des fonctionnalités telles que l'affichage des détails d'un logement spécifique lorsqu'un utilisateur clique sur un lien.",
        "filtre": ["Tous", "React"],
        "tag": ["React", "Javascript", "Scss", "Responsive design"],
        "urlCode": "https://github.com/OCAntoni/Projet-8",
        "urlWebsite": ""
    },
    {
        "id": "6",
        "image": "/imgData/nina_carducci.png",
        "title": "Nina Carducci, portfolio",
        "description": "Travail d'optimisation pour ce site qui nécessitait une refonte afin d'optimiser la visilité, la performance, ainsi qu'un meilleur référencement. A présent le site de Nina est optimisé afin d'améliorer sa présence en ligne, à attirer plus de trafic vers son site, et donc à mettre en valeur son travail.",
        "filtre": ["Tous", "SEO"],
        "tag": ["SEO"],
        "urlCode": "https://github.com/OCAntoni/Projet-9",
        "urlWebsite": "https://ocantoni.github.io/Projet-9/"
    },
    {
        "id": "7",
        "image": "/imgData/724events.png",
        "title": "724events",
        "description": "Agence évènementielle, 724events possédait un site avec de nombreux problèmes majeurs. J'ai donc été en charge de la partie de résolutions de bugs, traiter les tests unitaires et fonctionnels ainsi que la rédaction d'un cahier de recette pour le client.",
        "filtre": ["Tous", "Debug"],
        "tag": ["React", "Javascript", "Bug"],
        "urlCode": "https://github.com/OCAntoni/Projet-10",
        "urlWebsite": ""
    },
    {
        "id": "8",
        "image": "/imgData/argentbank.webp",
        "title": "ArgentBank",
        "description": "ArgentBank est une toute nouvelle banque en ligne qui souhaite que leurs clients puissent consulter leurs opérations et qu'ils puissent avoir la possibilité de modifier des opérations. J'ai travaillé sur ce projet sur la gestion de connexion utilisateur, la gestion de l'état global de l'app avec redux, ainsi que la conception de nouvelles routes API pour la suite du développement.",
        "filtre": ["Tous", "React"],
        "tag": ["React", "Redux", "Javascript", "Scss", "Login"],
        "urlCode": "https://github.com/OCAntoni/Projet-11",
        "urlWebsite": ""
    }
]